In [45]:
import pandas as pd

In [3]:
xls = pd.ExcelFile("Hospital  Health Care Management Data set.xlsx")
xls.sheet_names

['Detail data dataset', 'Staff_Detail', 'Department', 'Bed_Detail']

In [6]:
for sheet in xls.sheet_names:
    df = pd.read_excel(xls,sheet_name=sheet)
    print(f"Columns in '{sheet}':")
    print(df.columns.tolist())
    print()

Columns in 'Detail data dataset':
['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State', 'Age', 'Patient type', 'Status', 'treatemencost', 'Bed', 'LOS', 'ER_Time', 'Date', 'Feedback', 'Rating', 'Age Bucket', 'Custom', 'FZ me']

Columns in 'Staff_Detail':
['Staff_Id', 'Staff Name']

Columns in 'Department':
['Dpt_ID', 'Department_Name']

Columns in 'Bed_Detail':
['Bed_ID', 'Bed Number']

In [46]:
# Splitting excel sheets into 4 different CSV Files
xls = pd.ExcelFile("Hospital  Health Care Management Data set.xlsx")

detail_df = pd.read_excel(xls,sheet_name='Detail data dataset')
staff_df = pd.read_excel(xls,sheet_name='Staff_Detail')
department_df = pd.read_excel(xls,sheet_name='Department')
bed_df = pd.read_excel(xls, sheet_name='Bed_Detail')

In [47]:
staff_df

     Staff_Id Staff Name
0       30001         f1
1       30002         f2
2       30003         f3
3       30004         f4
4       30005         f5
..        ...        ...
257     30258       f258
258     30259       f259
259     30260       f260
260     30261       f261
261     30262       f262

[262 rows x 2 columns]

In [9]:
# Saving as CSVs
detail_df.to_csv("detail_data.csv",index=False)
staff_df.to_csv("staff_data.csv",index=False)
department_df.to_csv("department_data.csv",index=False)
bed_df.to_csv("bed_data.csv",index=False)

In [48]:
#Loading Data Back from CSV

detail_df = pd.read_csv("detail_data.csv")
staff_df = pd.read_csv("staff_data.csv")
dept_df = pd.read_csv("department_data.csv")
bed_df = pd.read_csv("bed_data.csv")

In [49]:
staff_df.head()

   Staff_Id Staff Name
0     30001         f1
1     30002         f2
2     30003         f3
3     30004         f4
4     30005         f5

In [50]:
detail_df.head()

,Staff_Id,Bed_ID,Dpt_ID,ID,Name,Gender,City,State,Age,Patient type,Status,treatemencost,Bed,LOS,ER_Time,Date,Feedback,Rating,Age Bucket,Custom,FZ me
0,30016,NaN,108,278,"Allen, Savannah",F,oxford,California,7,outpatient,Normal,274.48,NaN,0,23.0,2007-10-16,Fully Agree,5.0,6-20Y,Null,Postive
1,30032,NaN,108,294,"Alonso, Arthur",M,Chula Vista,England,43,outpatient,Normal,274.48,NaN,0,30.0,2007-11-01,Fully Agree,5.0,41-60y,Null,Postive
2,30040,NaN,108,302,"Alonso, Carrie",F,Royal Oak,Seine (Paris),2,outpatient,Normal,274.48,NaN,0,36.0,2007-11-09,Fully Agree,5.0,Below 6Y,Null,Postive
3,30046,NaN,108,308,"Alonso, Danny",M,Royal Oak,Queensland,8,outpatient,Normal,274.48,NaN,0,50.0,2007-11-15,Fully Agree,5.0,6-20Y,Null,Postive
4,30052,NaN,108,314,"Alonso, Diane",F,Royal Oak,New South Wales,14,outpatient,Normal,274.48,NaN,0,48.0,2007-11-21,Fully Agree,5.0,6-20Y,Null,Postive

In [51]:
detail_df[detail_df.duplicated(subset=['ID'])]

Empty DataFrame
Columns: [Staff_Id, Bed_ID, Dpt_ID, ID, Name, Gender, City, State, Age, Patient type, Status, treatemencost, Bed, LOS, ER_Time, Date, Feedback, Rating, Age Bucket, Custom, FZ me]
Index: []

In [52]:
detail_df.duplicated(subset='ID').sum()

np.int64(0)

In [54]:
detail_df[detail_df.duplicated()]

Empty DataFrame
Columns: [Staff_Id, Bed_ID, Dpt_ID, ID, Name, Gender, City, State, Age, Patient type, Status, treatemencost, Bed, LOS, ER_Time, Date, Feedback, Rating, Age Bucket, Custom, FZ me]
Index: []

Above operation shows that there are no duplicate values in 'detail_data'

In [55]:
detail_df.columns

Index(['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State',
       'Age', 'Patient type', 'Status', 'treatemencost', 'Bed', 'LOS',
       'ER_Time', 'Date', 'Feedback', 'Rating', 'Age Bucket', 'Custom',
       'FZ me'],
      dtype='object')

In [56]:
pd.set_option('display.max_columns',None)

In [57]:
detail_df.head()

,Staff_Id,Bed_ID,Dpt_ID,ID,Name,Gender,City,State,Age,Patient type,Status,treatemencost,Bed,LOS,ER_Time,Date,Feedback,Rating,Age Bucket,Custom,FZ me
0,30016,NaN,108,278,"Allen, Savannah",F,oxford,California,7,outpatient,Normal,274.48,NaN,0,23.0,2007-10-16,Fully Agree,5.0,6-20Y,Null,Postive
1,30032,NaN,108,294,"Alonso, Arthur",M,Chula Vista,England,43,outpatient,Normal,274.48,NaN,0,30.0,2007-11-01,Fully Agree,5.0,41-60y,Null,Postive
2,30040,NaN,108,302,"Alonso, Carrie",F,Royal Oak,Seine (Paris),2,outpatient,Normal,274.48,NaN,0,36.0,2007-11-09,Fully Agree,5.0,Below 6Y,Null,Postive
3,30046,NaN,108,308,"Alonso, Danny",M,Royal Oak,Queensland,8,outpatient,Normal,274.48,NaN,0,50.0,2007-11-15,Fully Agree,5.0,6-20Y,Null,Postive
4,30052,NaN,108,314,"Alonso, Diane",F,Royal Oak,New South Wales,14,outpatient,Normal,274.48,NaN,0,48.0,2007-11-21,Fully Agree,5.0,6-20Y,Null,Postive

In [58]:
for sheet in xls.sheet_names:
    df = pd.read_excel(xls,sheet_name=sheet)
    print(f"Columns in '{sheet}':")
    print(df.columns.tolist())
    print()

Columns in 'Detail data dataset':
['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State', 'Age', 'Patient type', 'Status', 'treatemencost', 'Bed', 'LOS', 'ER_Time', 'Date', 'Feedback', 'Rating', 'Age Bucket', 'Custom', 'FZ me']

Columns in 'Staff_Detail':
['Staff_Id', 'Staff Name']

Columns in 'Department':
['Dpt_ID', 'Department_Name']

Columns in 'Bed_Detail':
['Bed_ID', 'Bed Number']

Main motive for above cell operation is to Standarize column names across all 4 csv files.

In [59]:
# Dropping Redundant Columns first. As can be seen above . only detail_df have 
# redundant/useless columns
cols_to_drop = ['Bed', 'Age Bucket', 'Custom', 'FZ me']
detail_df = detail_df.drop(columns=cols_to_drop)

In [60]:
detail_df.columns

Index(['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State',
       'Age', 'Patient type', 'Status', 'treatemencost', 'LOS', 'ER_Time',
       'Date', 'Feedback', 'Rating'],
      dtype='object')

In [61]:
# Applying some more Pre-processing tasks :

#Standardize Column Names

detail_df = detail_df.rename(columns={
    'Patient type':'Patient_Type',
    'treatemencost':'Treatment_Cost',
    'LOS':'Length_of_Stay'
})

In [62]:
detail_df.columns

Index(['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State',
       'Age', 'Patient_Type', 'Status', 'Treatment_Cost', 'Length_of_Stay',
       'ER_Time', 'Date', 'Feedback', 'Rating'],
      dtype='object')

In [63]:
#Gender Mapping
detail_df['Gender'] = detail_df['Gender'].str.upper().replace({
    'F':'Female',
    'M':'Male'
})

In [ ]:
#Clean Text Columns (Strip Spaces & Standardize Case)
for col in ['Name','Gender','City','State','Patient_Type','Status','Feedback']:
    detail_df[col] = detail_df[col].astype(str).str.strip().str.title()

.title() converts the text in a string to Title Case — meaning:

First letter of each word becomes uppercase

All other letters become lowercase

In [66]:
#Convert Numeric Columns
detail_df['Age'] = pd.to_numeric(detail_df['Age'], errors='coerce')
detail_df['Treatment_Cost'] = pd.to_numeric(detail_df['Treatment_Cost'], errors='coerce')
detail_df['Length_of_Stay'] = pd.to_numeric(detail_df['Length_of_Stay'], errors='coerce')
detail_df['Rating'] = pd.to_numeric(detail_df['Rating'], errors='coerce')

errors='coerce'
Convert invalid values to NaN
safest for cleaning

In [69]:
#Age column
detail_df[detail_df['Age']>120]

Empty DataFrame
Columns: [Staff_Id, Bed_ID, Dpt_ID, ID, Name, Gender, City, State, Age, Patient_Type, Status, Treatment_Cost, Length_of_Stay, ER_Time, Date, Feedback, Rating]
Index: []

In [70]:
#Treatment cost :
detail_df[detail_df['Treatment_Cost']==0]

Empty DataFrame
Columns: [Staff_Id, Bed_ID, Dpt_ID, ID, Name, Gender, City, State, Age, Patient_Type, Status, Treatment_Cost, Length_of_Stay, ER_Time, Date, Feedback, Rating]
Index: []

In [72]:
#Validate Foreign Key Links (important for SQLite)
detail_df = detail_df[detail_df['Staff_Id'].isin(staff_df['Staff_Id'])]
detail_df = detail_df[detail_df['Bed_ID'].isin(bed_df['Bed_ID'])]
detail_df = detail_df[detail_df['Dpt_ID'].isin(dept_df['Dpt_ID'])]

In [73]:
detail_df

,Staff_Id,Bed_ID,Dpt_ID,ID,Name,Gender,City,State,Age,Patient_Type,Status,Treatment_Cost,Length_of_Stay,ER_Time,Date,Feedback,Rating
755,30002,20002.0,101,2,"Adams, Adam",Male,Downey,California,70,Inpatient,Icu,44.73,4,36.0,2007-01-12,Fully Agree,5.0
756,30004,20004.0,101,4,"Adams, Alexandra",Female,Downey,California,64,Inpatient,Icu,815.22,3,90.0,2007-01-14,Fully Disagree,1.0
757,30008,20008.0,101,8,"Adams, Andrea",Female,Downey,California,5,Inpatient,Icu,274.48,4,40.0,2007-01-18,Fully Agree,5.0
758,30009,20009.0,102,9,"Adams, Angel",Male,Downey,California,6,Inpatient,Icu,44.73,8,60.0,2007-01-19,Fully Agree,5.0
759,30010,20010.0,102,10,"Adams, Bailey",Female,Downey,Washington,7,Inpatient,Icu,274.48,8,180.0,2007-01-20,Fully Agree,5.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2501,30219,21735.0,109,2053,"Carlson, Armando",Male,Cliffside,British Columbia,2,Inpatient,Readmit,3.17,2,NaN,2007-03-16,Fully Agree,5.0
2502,30220,21736.0,109,2054,"Carlson, Arthur",Male,Cliffside,British Columbia,2,Inpatient,Readmit,3.56,2,NaN,2007-05-20,Fully Agree,5.0
2503,30223,21739.0,109,2057,"Carlson, Billy",Male,Cliffside,British Columbia,2,Inpatient,Readmit,197.28,2,NaN,2007-01-24,Fully Agree,5.0
2504,30226,21742.0,109,2060,"Carlson, Bruce",Male,Cliffside,British Columbia,2,Inpatient,Readmit,32.25,2,NaN,2007-04-16,Fully Agree,5.0
2505,30227,21743.0,109,2061,"Carlson, Byron",Male,Cliffside,British Columbia,2,Inpatient,Readmit,2.75,2,NaN,2007-12-25,Fully Agree,5.0

In [76]:
dfs = {
    'detail_df': detail_df,
    'staff_df': staff_df,
    'dept_df': dept_df,
    'bed_df': bed_df
}

for name,df in dfs.items():
    print(f"Column in name {name}:")
    print(df.columns.tolist())
    print()

Column in name detail_df:
['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State', 'Age', 'Patient_Type', 'Status', 'Treatment_Cost', 'Length_of_Stay', 'ER_Time', 'Date', 'Feedback', 'Rating']

Column in name staff_df:
['Staff_Id', 'Staff Name']

Column in name dept_df:
['Dpt_ID', 'Department_Name']

Column in name bed_df:
['Bed_ID', 'Bed Number']

In [89]:
staff_df.rename(columns = {'Staff Name':'Staff_Name'},inplace=True)
bed_df.rename(columns={'Bed Number':'Bed_Number'},inplace=True)

In [90]:
dfs = {
    'detail_df': detail_df,
    'staff_df': staff_df,
    'dept_df': dept_df,
    'bed_df': bed_df
}

for name,df in dfs.items():
    print(f"Column in name {name}:")
    print(df.columns.tolist())
    print()

Column in name detail_df:
['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State', 'Age', 'Patient_Type', 'Status', 'Treatment_Cost', 'Length_of_Stay', 'ER_Time', 'Date', 'Feedback', 'Rating']

Column in name staff_df:
['Staff_Id', 'Staff_Name']

Column in name dept_df:
['Dpt_ID', 'Department_Name']

Column in name bed_df:
['Bed_ID', 'Bed_Number']

Creating the SQLite Database & Schema

In [80]:
import sqlite3

In [81]:
connection = sqlite3.connect("hospital_warehouse.db")
cursor = connection.cursor()

In [82]:
cursor.executescript(
    """
    PRAGMA foreign_keys = ON;
    """
)

Tables i am going to create :
1) dim_patient : Information about patients
2) dim_staff : Information about staff/doctors
3) dim_department : Names of hospital departments
4) dim_bed : Bed descriptions/numbers/locations

5) fact_treatment : Stores each treatment event and its cost, duration, etc.

In [137]:
dfs = {
    'detail_df': detail_df,
    'staff_df': staff_df,
    'dept_df': dept_df,
    'bed_df': bed_df
}

for name,df in dfs.items():
    print(f"Column in name {name}:")
    print(df.columns.tolist())
    print()

Column in name detail_df:
['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State', 'Age', 'Patient_Type', 'Status', 'Treatment_Cost', 'Length_of_Stay', 'ER_Time', 'Date', 'Feedback', 'Rating']

Column in name staff_df:
['Staff_Id', 'Staff_Name']

Column in name dept_df:
['Dpt_ID', 'Department_Name']

Column in name bed_df:
['Bed_ID', 'Bed_Number']

In [138]:
command = """
DROP TABLE IF EXISTS fact_treatment;
DROP TABLE IF EXISTS dim_patient;
DROP TABLE IF EXISTS dim_staff;
DROP TABLE IF EXISTS dim_department;
DROP TABLE IF EXISTS dim_dept;
DROP TABLE IF EXISTS dim_bed;

CREATE TABLE dim_patient(
ID INTEGER PRIMARY KEY,
Name TEXT ,
Gender TEXT,
City TEXT,
State TEXT,
Age INTEGER,
Patient_Type TEXT
);

CREATE TABLE dim_staff(
Staff_Id INTEGER PRIMARY KEY,
Staff_Name TEXT
);

CREATE TABLE dim_dept(
Dpt_ID INTEGER PRIMARY KEY,
Department_Name TEXT
);

CREATE TABLE dim_bed(
Bed_ID INTEGER PRIMARY KEY,
Bed_Number TEXT
);

"""

In [139]:
cursor.executescript(command)

In [140]:
cursor.execute(
    """
    SELECT * FROM dim_staff;
    """
)

rows = cursor.fetchall()
print(rows)

[]

List of ALL tables present in DB :

In [141]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
for table in tables:
    print(table[0])

sqlite_sequence
dim_patient
dim_staff
dim_dept
dim_bed

In [142]:
cursor.execute("SELECT * FROM dim_patient")
row = cursor.fetchall()
print(row)

[]

In [143]:
dfs = {
    'detail_df': detail_df,
    'staff_df': staff_df,
    'dept_df': dept_df,
    'bed_df': bed_df
}

for name,df in dfs.items():
    print(f"Column in name {name}:")
    print(df.columns.tolist())
    print()

Column in name detail_df:
['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State', 'Age', 'Patient_Type', 'Status', 'Treatment_Cost', 'Length_of_Stay', 'ER_Time', 'Date', 'Feedback', 'Rating']

Column in name staff_df:
['Staff_Id', 'Staff_Name']

Column in name dept_df:
['Dpt_ID', 'Department_Name']

Column in name bed_df:
['Bed_ID', 'Bed_Number']

In [144]:
cursor.executescript(
    """
    DROP TABLE IF EXISTS fact_treatment;

    CREATE TABLE fact_treatment(
    Fact_ID INTEGER PRIMARY KEY AUTOINCREMENT,
    Staff_Id INTEGER,
    Bed_ID INTEGER,
    Dpt_ID INTEGER,
    ID INTEGER,
    Status TEXT,
    Treatment_Cost REAL,
    Length_of_Stay REAL,
    ER_Time REAL,
    Date TEXT,
    Feedback TEXT,
    Rating REAL,

    FOREIGN KEY (Staff_Id) REFERENCES dim_staff(Staff_Id),
    FOREIGN KEY (ID) REFERENCES dim_patient(ID),
    FOREIGN KEY (Dpt_ID) REFERENCES dim_dept(Dpt_ID),
    FOREIGN KEY (Bed_ID) REFERENCES dim_bed(Bed_ID)
    );
    """
)

In [145]:
connection.commit()

In [146]:
print("Database and tables created successfully.")

Database and tables created successfully.

In [147]:
cursor.execute("SELECT name from sqlite_master where type='table';")
tables = cursor.fetchall()
print(tables)

[('sqlite_sequence',), ('dim_patient',), ('dim_staff',), ('dim_dept',), ('dim_bed',), ('fact_treatment',)]

In [148]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
for table in tables:
    print(table[0])

sqlite_sequence
dim_patient
dim_staff
dim_dept
dim_bed
fact_treatment

Now databases and tables have been created . Now its time to insert values into it.

In [149]:
detail_df.head()

,Staff_Id,Bed_ID,Dpt_ID,ID,Name,Gender,City,State,Age,Patient_Type,Status,Treatment_Cost,Length_of_Stay,ER_Time,Date,Feedback,Rating
755,30002,20002.0,101,2,"Adams, Adam",Male,Downey,California,70,Inpatient,Icu,44.73,4,36.0,2007-01-12,Fully Agree,5.0
756,30004,20004.0,101,4,"Adams, Alexandra",Female,Downey,California,64,Inpatient,Icu,815.22,3,90.0,2007-01-14,Fully Disagree,1.0
757,30008,20008.0,101,8,"Adams, Andrea",Female,Downey,California,5,Inpatient,Icu,274.48,4,40.0,2007-01-18,Fully Agree,5.0
758,30009,20009.0,102,9,"Adams, Angel",Male,Downey,California,6,Inpatient,Icu,44.73,8,60.0,2007-01-19,Fully Agree,5.0
759,30010,20010.0,102,10,"Adams, Bailey",Female,Downey,Washington,7,Inpatient,Icu,274.48,8,180.0,2007-01-20,Fully Agree,5.0

In [150]:
dim_patient = detail_df[['ID','Name','Gender','City','State','Age','Patient_Type']].drop_duplicates()
dim_patient.to_sql('dim_patient',connection,if_exists='append',index=False)

1751

In [151]:
staff_df.head()

   Staff_Id Staff_Name
0     30001         f1
1     30002         f2
2     30003         f3
3     30004         f4
4     30005         f5

In [152]:
dim_staff = staff_df[['Staff_Id','Staff_Name']].drop_duplicates()
dim_staff.to_sql('dim_staff',connection,if_exists='append',index=False)

262

In [153]:
dept_df

   Dpt_ID                                  Department_Name
0     101                                       Cardiology
1     102                                      Dermatology
2     103                                      Gynaecology
3     104                                        Neurology
4     105                                         oncology
5     106                                       Othopadics
6     107                                          Surgery
7     108                  OPD Outpatient department (OPD)
8     109  Physical Medicine and Rehabilitation Department
9     110                                               OT

In [154]:
dept_df.to_sql('dim_dept', connection, if_exists='append', index=False)

10

In [155]:
bed_df

      Bed_ID Bed_Number
0      20001         X1
1      20002         X2
2      20003         X3
3      20004         X4
4      20005         X5
...      ...        ...
2842   22843      X2843
2843   22844      X2844
2844   22845      X2845
2845   22846      X2846
2846   22847      X2847

[2847 rows x 2 columns]

In [156]:
bed_df.to_sql('dim_bed',connection,if_exists='append',index=False)

2847

In [157]:
connection.commit()

In [158]:
print("Data inserted with PK/FK constraints applied.")

Data inserted with PK/FK constraints applied.

In [159]:
cursor.execute("SELECT * FROM dim_dept")
rows = cursor.fetchall()
rows

[(101, 'Cardiology'),
 (102, 'Dermatology'),
 (103, 'Gynaecology'),
 (104, 'Neurology'),
 (105, 'oncology'),
 (106, 'Othopadics'),
 (107, 'Surgery'),
 (108, 'OPD Outpatient department (OPD)'),
 (109, 'Physical Medicine and Rehabilitation Department'),
 (110, 'OT')]

In [160]:
len(rows)

10

Now all dimension table data has been inserted . Now its time to insert Fact data

In [161]:
detail_df.head()

,Staff_Id,Bed_ID,Dpt_ID,ID,Name,Gender,City,State,Age,Patient_Type,Status,Treatment_Cost,Length_of_Stay,ER_Time,Date,Feedback,Rating
755,30002,20002.0,101,2,"Adams, Adam",Male,Downey,California,70,Inpatient,Icu,44.73,4,36.0,2007-01-12,Fully Agree,5.0
756,30004,20004.0,101,4,"Adams, Alexandra",Female,Downey,California,64,Inpatient,Icu,815.22,3,90.0,2007-01-14,Fully Disagree,1.0
757,30008,20008.0,101,8,"Adams, Andrea",Female,Downey,California,5,Inpatient,Icu,274.48,4,40.0,2007-01-18,Fully Agree,5.0
758,30009,20009.0,102,9,"Adams, Angel",Male,Downey,California,6,Inpatient,Icu,44.73,8,60.0,2007-01-19,Fully Agree,5.0
759,30010,20010.0,102,10,"Adams, Bailey",Female,Downey,Washington,7,Inpatient,Icu,274.48,8,180.0,2007-01-20,Fully Agree,5.0

In [162]:
detail_df.columns

Index(['Staff_Id', 'Bed_ID', 'Dpt_ID', 'ID', 'Name', 'Gender', 'City', 'State',
       'Age', 'Patient_Type', 'Status', 'Treatment_Cost', 'Length_of_Stay',
       'ER_Time', 'Date', 'Feedback', 'Rating'],
      dtype='object')

In [163]:
cursor.execute("PRAGMA table_info(fact_treatment);")
schema = cursor.fetchall()

for column in schema:
    print(column)

(0, 'Fact_ID', 'INTEGER', 0, None, 1)
(1, 'Staff_Id', 'INTEGER', 0, None, 0)
(2, 'Bed_ID', 'INTEGER', 0, None, 0)
(3, 'Dpt_ID', 'INTEGER', 0, None, 0)
(4, 'ID', 'INTEGER', 0, None, 0)
(5, 'Status', 'TEXT', 0, None, 0)
(6, 'Treatment_Cost', 'REAL', 0, None, 0)
(7, 'Length_of_Stay', 'REAL', 0, None, 0)
(8, 'ER_Time', 'REAL', 0, None, 0)
(9, 'Date', 'TEXT', 0, None, 0)
(10, 'Feedback', 'TEXT', 0, None, 0)
(11, 'Rating', 'REAL', 0, None, 0)

In [164]:
fact_treatment = detail_df[['Staff_Id','Bed_ID', 'Dpt_ID','ID', 'Status', 
                            'Treatment_Cost', 'Length_of_Stay',
                            'ER_Time', 'Date', 'Feedback', 'Rating']]

fact_treatment.to_sql('fact_treatment',connection,if_exists='append',index=False)

1751

In [165]:
cursor.execute("""
SELECT name FROM sqlite_master where type='table';
""")

tables = cursor.fetchall()
for table in tables :
    print(table[0])

sqlite_sequence
dim_patient
dim_staff
dim_dept
dim_bed
fact_treatment

My schema is fully NLQ-ready because:

Every entity is stored once in dimension tables

All metrics live in the fact table

PK/FK enforce clean referential integrity

Column names are clean & human-readable

In [168]:
staff_df

     Staff_Id Staff_Name
0       30001         f1
1       30002         f2
2       30003         f3
3       30004         f4
4       30005         f5
..        ...        ...
257     30258       f258
258     30259       f259
259     30260       f260
260     30261       f261
261     30262       f262

[262 rows x 2 columns]

In [170]:
cursor.execute("select count(*) from dim_staff")
ans = cursor.fetchall()
ans

[(262,)]